package org.itstep.task02;

/**
 * Задание 2
 * Создайте класс «Город» (City). Необходимо хранить в по-
 * лях класса: название города (name), название региона (region), название
 * страны (country), количество жителей в городе (inhabitants), почтовый индекс
 * города (index), телефонный код города (code). Реализуйте методы клас-
 * са для ввода данных, вывода данных, реализуйте конструктор с параметром и по умолчанию.
 */
public class Main {
    public static void main(String[] args) {
        // FIXME: здесь пример использования класса
    }
}
