package ua.step.homework;

import java.io.IOException;

/**
 * Даны координаты начала и координаты конца отрезка. Если считать
 * отрезок обозначением горки, то в одном случае он обозначает спуск, в другой
 * подъем. Определить и вывести на экран спуск это или подъем, ровная дорога или
 * вообще отвестная.
 * Пример Ввод 1 1 2 2 Вывод подъем
 * Пример Ввод 1 1 2 1 Вывод ровно
 * 
 */
public class Task09
{
    public static void main(String[] args) throws IOException
    {
        int x1 = 1;
        int y1 = 1;
        int x2 = 2;
        int y2 = 2;

    }
}