package ua.step.homework;

import java.util.Scanner;

/**
 * Написать программу, которая предлагает пользователю ввести номер дня недели,
 * и в ответ показывает название этого дня (например, 6 – это суббота).
 */
public class Task01 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.print("Введите номер дня недели от 1 до 7, где 1 это понедельник: ");
        int i = scanner.nextInt();

        // TODO: здесь ваш код

    }
}