package org.itstep.task03;

/**
 * Задание 3
 * Создайте класс «Страна». Необходимо хранить
 * в полях класса: название страны, название конти-
 * нента, количество жителей в стране, телефонный код
 * страны, название столицы, название городов страны.
 * Реализуйте методы класса для ввода данных, вывода
 * данных, реализуйте доступ к отдельным полям через
 * методы класса.
 */
public class Main {
    public static void main(String[] args) {
        // FIXME: здесь пример использования класса
    }
}
