package org.itstep.task03;

/**
 * Задание 3
 * Создайте класс «Страна» (Country). Необходимо хранить
 * в полях класса: название страны (name), название конти-
 * нента (continent), телефонный код страны (code), название столицы (capital - класс City),
 * города страны (cities - массив City).
 * Реализуйте методы класса для ввода данных, вывода
 * данных, реализуйте доступ к отдельным полям через
 * методы класса. Добавить метод addCity для добавления нового города.
 * Метод getInhabitants должен возвращать количество жителей во всех городах страны.
 * Реализовать два конструктора: один по умолчанию, второй с пятью параметрами:
 * название страны (name), название континента (continent),
 * количество жителей в стране (inhabitants), телефонный код страны (code),
 * название столицы (capital).
 * В этом классе должен быть агрегирован класс Города (City) из предыдущей задачи.
 */
public class Main {
    public static void main(String[] args) {
        // FIXME: здесь пример использования класса
    }
}
