package org.itstep.task03;

/**
 * Задание 3
 * Создайте класс «Страна» (Country). Необходимо хранить
 * в полях класса: название страны (name), название конти-
 * нента (continent), количество жителей в стране (inhabitants), телефонный код
 * страны (code), название столицы (capital), название городов страны (cities).
 * Реализуйте методы класса для ввода данных, вывода
 * данных, реализуйте доступ к отдельным полям через
 * методы класса. Добавить метод addCity для добавления нового города.
 * Реализовать два конструктора: один по умолчанию, второй с пятью параметрами:
 * название страны (name), название континента (continent),
 * количество жителей в стране (inhabitants), телефонный код страны (code),
 * название столицы (capital)
 */
public class Main {
    public static void main(String[] args) {
        // FIXME: здесь пример использования класса
    }
}
