package org.itstep.hw04;

public class Task02 {
    /**
     * Есть задача: поднять тяжелый камень, но для этого необходимо усилие 10 человек.
     * Человек - это класс, который выполняет определенную работу в отдельном потоке.
     * Написать программу, в которой создать 10 потоков (людей), которые совместными
     * услиями одновременно (только когда соберется 10 человек) смогут сдвинуть камень.
     *
     * Какой способ синхронизации лучше всего для этого использовать: Semaphore,
     * CountDownLatch или CyclicBarrier.
     *
     * Для запуска потоков использовать ThreadPool
     * @param args
     */
    public static void main(String[] args) {

    }
}
