package ua.step.homework02;

import java.util.Scanner;

/**
 * Напишите программу, которая будет печатать ромбовидный рисунок на основе
 * строки введённой с клавиатуры (максимальная длина – 50 символов). Пример
 * вывода, если строка "testing"
 */
public class Task10 {
	/*
	  Пример для testing

      t
     te
    tes
   test
  testi
 testin
testing
esting
sting
ting
ing
ng
g
	 */
	public static void main(String[] args) {
		Scanner scanner = new Scanner(System.in);
		System.out.println("Введете строку");
		String line = scanner.nextLine();

	}
}
