package ua.step.homework02;

import java.sql.Array;
import java.util.Arrays;
import java.util.Scanner;

/**
 * Задание: Пользователь вводит с клавиатуры строку. Поменять все большие буквы на
 * маленькие, а маленькие на большие.
 * <p>
 * Пример:
 * При введенной строке: iTsTEP
 * Вывод на консоль должен быть: ItStep
 */
public class Task07 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.print("Введите строку: ");
        String line = scanner.nextLine();

        // TODO: Пишите код здесь

    }
}
