package ua.step.homework02;

import java.util.Arrays;
import java.util.Scanner;

/**
 * Задание: Ввести строку с клавиатуры. В строке должны содержатся слова раздельные
 * пробелами и двоеточиями. Необходимо вычислить количество слов в строке, у
 * которых чётное количество букв.
 *
 * Пример:
 * Для введенной строки "ab:baa aba:abcd:fgfwdf rr"
 * вывод на консоль будет 4
 */
public class Task05 {
	public static void main(String[] args) {
		Scanner scanner = new Scanner(System.in);
		System.out.print("Введите строку: ");
		String line = scanner.nextLine();

		// TODO: Пишите код здесь

	}
}
