package ua.step.homework02;

import java.util.Arrays;
import java.util.Scanner;
import java.util.stream.Collectors;
import java.util.stream.Stream;

/**
 * Задание: Написать программу которая будет подсчитывать количество слов, гласных и
 * согласных букв в строке введённой пользователем. Дополнительно выводить
 * количество знаков пунктуации, цифр и др. символов.
 * <p>
 * Прмер:
 * Для введенной строки: "Hello World"
 * Вывод на консоль будет:
 * Слов - 2
 * Гласных - 3
 * Согласных - 7
 */
public class Task06 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.print("Введите строку: ");
        String line = scanner.nextLine().toLowerCase();

        // TODO: Пишите код здесь

    }


}
