package ua.step.homework02;

import java.util.Scanner;

/**
 * Пользователь вводит с клавиатуры строку. Поменять все большие буквы на
 * маленькие, а маленькие на большие.
 */
public class Task07 {
	public static void main(String[] args) {
		Scanner scanner = new Scanner(System.in);
		System.out.println("Введите строку");
		String line = scanner.nextLine();
	}
}
