package ua.step.homework02;

import java.util.Arrays;
import java.util.Scanner;

/**
 * Задание: Подсчитать среднюю длину слова во введённом с клавиатуры предложении.
 * Дробную часть при выводе отбросить.
 *
 * Пример:
 * Для входной строки "Hello World"
 * Результат будет 5
 */
public class Task03 {
	public static void main(String[] args) {
		Scanner scanner = new Scanner(System.in);
		System.out.print("Введите строку: ");
		String line = scanner.nextLine();

		// TODO: Пишите код здесь

	}
}
