package ua.step.homework02;

import java.util.Scanner;

/**
 * Написать программу которая будет подсчитывать количество слов, гласных и
 * согласных букв в строке введённой пользователем. Дополнительно выводить
 * количество знаков пунктуации, цифр и др. символов.
 */
public class Task06 {
	public static void main(String[] args) {
		Scanner scanner = new Scanner(System.in);
		System.out.println("Введите строку");
		String line = scanner.nextLine();
	}
}
