package ua.step.homework02;

import java.util.Scanner;

/**
 * Написать программу проверяющую является ли одна строка, анаграммой для другой
 * строки (строка может состоять из нескольких слов и символов пунктуации).
 * Пробелы и пунктуация должны игнорироваться при анализе. Разница в больших и
 * маленьких буквах должна игнорироваться. Обе строки должны вводиться с
 * клавиатуры. Программа должна выводить Yes если строки являются анаграммой и
 * No иначе.
 */
public class Task09 {
	public static void main(String[] args) {
		Scanner scanner = new Scanner(System.in);
		System.out.println("Название переменной");
		String line1 = scanner.nextLine();
		String line2 = scanner.nextLine();
	}
}
