package ua.step.homework;

import java.util.Scanner;

/**
 * Есть три переменных a, b и с эти переменный явно записаны три целых попарно
 * неравных между собой числа. Создать программу, которая переставит числа в
 * переменных таким образом, чтобы при выводе на экран последовательность a, b и
 * c оказалась строго возрастающей. Пример 7 4 5 Вывод 457
 * 
 */
public class Task03
{
    public static void main(String[] args)
    {
        int a = 7;
        int b = 4;
        int c = 5;
        // TODO не менять строку вывода
        System.out.printf("%d %d %d", a, b, c);
    }
}