package ua.step.homework03;

import java.util.Scanner;

/**
 * 
 * Создать массив размерности m x n заполненный случайными числами от -33 до
 * +55. Вывести на экран исходный массив и строку или столбец для которого средне арифметическое
 * его элементов максимально отличается от среднее арифметического значения для
 * всех элементов массива. Размерности массива должна задаваться с клавиатуры.
 */
public class Task09 {
	public static void main(String[] args) {
		Scanner scanner = new Scanner(System.in);
		System.out.println("Input n and m");
		int n = scanner.nextInt();
		int m = scanner.nextInt();
	}
}
