package ua.step.homework03;

import java.util.Random;

/**
 * 
 * Создать массив из 100 случайных чисел в диапазоне от - 300 до 555. Написать
 * программу, копирующую один массив в другой следующим образом: сначала
 * копируются последовательно все элементы, большие 0, затем последовательно все
 * элементы, равные 0, а затем последовательно все элементы, меньшие 0. Вывести
 * исходный массив. Вывести результирующий массив.
 *
 */
public class Task04 {
	public static void main(String[] args) {
		Random rnd = new Random();
	}
}
