package org.itstep.task01;

/**
 * Задание 1
 * Создайте класс «Человек» (Human). Необходимо хранить
 * в полях класса: ФИО (fullName), дату рождения (dateOfBirth), контактный теле-
 * фон (phone), город (city), страну (country), домашний адрес (address).
 * Реализуйте методы класса для ввода данных, вывода данных, реализуйте
 * доступ к отдельным полям через методы класса, конструктор с параметрами
 * и по умолчанию
 */
public class Main {
    public static void main(String[] args) {
        // TODO: Пишите классы в этом пакете
        // FIXME: здесь пример использования класса
    }
}
