package ua.step.homework02;

import java.util.Scanner;

/**
 * Задание: Нарисовать контур прямоугольного треугольника звездочками, прямым углом вверх и
 * влево.
 *
 * Для вывода использовать циклы и условные операторы
 *
 * Высота треугольника задается пользователем.
 *
 * Для n = 7 вывод:
 *
 * *******
 * *    *
 * *   *
 * *  *
 * * *
 * **
 * *
 */
public class Task02 {
    public static void main(String[] args) {
        // TODO: этот код необходимо оставить неизменным для теста @see TaskTest02.java
        int n;
        System.out.print("Введите высоту треугольника: ");
        Scanner scanner = new Scanner(System.in);
        n = scanner.nextInt();

        // TODO: Здесь Ваш код

    }
}
