package ua.step.homework02;

/**
 * Написать игру «Быки и коровы». Программа загадывает четырехзначное число,
 * цифры в котором не должны повторяться, но не показывает его игроку. Игрок
 * должен за 5 попыток угадать число. После попытки игрока программа выводит
 * число цифр расположение которых совпадает с загаданным числом — это быки.
 * Если цифра есть в числе, но находиться не на своём месте, то программы
 * выводит число таких цифр — это коровы. Если игрок угадал число, программа
 * должна вывести сообщение о выигрыше. Если за 5 попыток число не угадано,
 * вывести сообщение о проигрыше и загаданное число.
 *
 */
public class Task12 {
	public static void main(String[] args) {

	}
}
