package ua.step.homework02;

import java.util.Scanner;

/**
 * Задание: Нарисовать равнобедренный прямоугольный треугольник, прямым углом вверх заполненный и
 * пустой.
 *
 * Для вывода использовать циклы и условные операторы
 *
 * Высота треугольника задается пользователем.
 *
 * Для n = 4 вывод:
 *
 *    *
 *   * *
 *  *   *
 * *******
 */
public class Task03 {
    public static void main(String[] args) {
        // TODO: этот код необходимо оставить неизменным для теста @see TaskTest03.java
        int n;
        System.out.print("Введите высоту треугольника: ");
        Scanner scanner = new Scanner(System.in);
        n = scanner.nextInt();

        // TODO: Здесь Ваш код

    }
}
