package ua.step.homework02;

import java.util.Scanner;

/**
 * 
 * Задание: Нарисовать на экране лесенку.
 * Количество ступенек должно указыватся с клавиатуры.
 * 
 * Например, для n = 3 вывод в консоль:
 *
 * ***
 *   *
 *   ***
 *     *
 *     ***
 *
 */
public class Task06 {
	public static void main(String[] args) {
		// TODO: этот код необходимо оставить неизменным для теста @see TaskTest06.java
		int n;
		System.out.print("Введите количество ступеней лесенки: ");
		Scanner scanner = new Scanner(System.in);
		n = scanner.nextInt();

		// TODO: Здесь Ваш код

	}
}
