package ua.step.homework02;

import java.util.Scanner;

/**
 * Задание: Нарисовать звездочками прямоугольный треугольник, прямым углом внизу вправо.
 * Для вывода использовать циклы и условные операторы
 *
 * Высота треугольника задается пользователем.
 *
 * Для n = 9 вывод:
 *         *
 *        **
 *       ***
 *      ****
 *     *****
 *    ******
 *   *******
 *  ********
 * *********
 */
public class Task01 {
    public static void main(String[] args) {
        // TODO: этот код необходимо оставить неизменным для теста @see TaskTest01.java
        int n;
        System.out.print("Введите высоту треугольника: ");
        Scanner scanner = new Scanner(System.in);
        n = scanner.nextInt();

        // TODO: Здесь Ваш код

    }
}
