package ua.step.homework02;

import java.util.Scanner;

/**
 * Задание: Параллелограмм заполненный звездочками
 *
 * Для вывода использовать циклы и условные операторы
 *
 * Высота параллелограмма задается пользователем, а размер основания вычисляется
 * как 2n+1
 *
 * Например, для n = 4 вывод в консоль:
 *
 *     *********
 *    *********
 *   *********
 *  *********
 */
public class Task05 {
	public static void main(String[] args) {
        // TODO: этот код необходимо оставить неизменным для теста @see TaskTest05.java
        int n;
        System.out.print("Введите высоту параллелограмма: ");
        Scanner scanner = new Scanner(System.in);
        n = scanner.nextInt();

        // TODO: Здесь Ваш код

	}
}
