package org.itstep.task04;

/**
 * Задание 4
 * Создайте класс Дробь (Fraction). Необходимо хранить в полях
 * класса: числитель и знаменатель. Реализуйте методы клас-
 * са для ввода данных, вывода данных, реализуйте доступ
 * к отдельным полям через методы класса. Также создайте
 * методы класса для выполнения арифметических операций
 * (сложение (add), вычитание (minus), умножение (multiple), деление (division), и т.д.).
 * Методы должны принимать в качестве аргумента вторую дроб и
 * возвращать результат в виде дроби.
 * Создайте два конструктора: по умолчанию, и с параметрами
 */
public class Main {
    public static void main(String[] args) {
        // FIXME: здесь пример использования класса
    }
}
