package org.itstep.task04;

/**
 * Задание 4
 * Создайте класс Дробь. Необходимо хранить в полях
 * класса: числитель и знаменатель. Реализуйте методы клас-
 * са для ввода данных, вывода данных, реализуйте доступ
 * к отдельным полям через методы класса. Также создайте
 * методы класса для выполнения арифметических операций
 * (сложение, вычитание, умножение, деление, и т.д.).
 */
public class Main {
    public static void main(String[] args) {
        // FIXME: здесь пример использования класса
    }
}
