package ua.step.homework1;

/**
 * Палиндром — это последовательность символов, которая слева-направо и
 * справа-налево пишется одинаково. Например «АБА» или «АББ ББА». Дана
 * последовательность символов. Программа должна вывести какое минимальное
 * количество символов нужно удалить из строки, чтобы получить палиндром. Вывести
 * полученный палиндром. Длина последовательности не больше 20 символов,
 * вводится с клавиатуры.
 * 
 * 
 */
public class Task02 {
	public static void main(String[] args) {

	}
}
