package ua.step.homework1;

/**
 * Ниже показан пример треугольника из чисел.
 * <pre>
 *       7
 *      3 8
 *     8 1 0
 *    2 7 4 4
 *   4 5 2 6 5
 * </pre>
 * Написать программу, которая позволит:
 * - выводить значения треугольника на консоль в таком
 * виде как на рисунке;
 * - вычислять наибольшую с умму чисел, через
 * которые проходит путь, начинающийся на вершине и
 * заканчивающийся где-то на основании.
 *
 * 1. Каждый шаг может идти диагонально вниз-направо
 * или диагонально вниз-налево.
 * 2. Количество строк в треугольнике >1, но <100.
 * 3. Числа в треугольнике все целые от 0 до 99 включитель-
 * но (генерируются случайным образом).
 *
 * В примере, описанном выше, это путь 7, 3, 8, 7, 5, дающий
 * максимальную сумму 30.
 *
 * Программа должна выводить на экран треугольник и
 * путь, который даст максимальный результат. Для текущего
 * примера он будет такой – влево, влево, вправо, влево.
 */
public class Task04 {
	public static void main(String[] args) {

	}
}
