package ua.step.example.part1.string;

/**
 * 
 * Получение символа из строки по индексу.
 *
 */
public class Task07 {
	public static void main(String[] args) {
		String testString = "Котёнок";
		char myChar = testString.charAt(2); // получние третьего символа
		System.out.println(myChar);
		
		// FIXME написать прорграмму, которая выведет каждую букву из строки
		// testString в отдельной строке
		// Создать цикл for и использовать его индекс в методе charAt
		
	}
}
