package org.itstep.homework;

/**
 * Реализовать приложение книжный магазин.
 *
 * Клиент может зарегистрироваться в книжном магазине, при этом он получит уникальный идентификатор и кредит.
 *
 * Кроме того, клиент может быть удален из списка в соответствии с его запросом.
 * В книжном магазине хранится два массива: клиентов и книг. Подумать над реализацией динамического массива
 * (не использовать стандарные коллекции).
 *
 * Клиент должен предоставить имя и адрес при регистрации, также он должен установить пароль для защиты своего счета.
 * Адрес и пароль может быть изменен владельцем. Клиент может купить книги в кредит или за наличные.
 *
 * Кредит имеет ограничение в 1000 грн.
 *
 * 7 интерфейсов и 1 абстрактный класс представлены ниже, смысл каждого метода можно легко понять по имени метода.
 * Вы должны реализовать все эти интерфейсы и класс.
 *
 * Напишите небольшое приложение демонстрирующее применение реализованных классов.
 *
 * Реализовать набор тестов для проврки работостпособности программы
 */
public class Main {
    public static void main(String[] args) {

    }
}


