package ua.step.homework;
/*
 * Шаблон для решения домашнеего задания. 
 */

/**
 * Ученикам первого класса дают 1 пирожок, если вес первоклассника менее 30 кг
 * дополнительно дают 1 стакан молока и ещё 1 пирожок. В первых классах школы
 * учится n учеников. Стакан молока имеет ёмкость 200 мл, а упаковка молока –
 * 0,9 л. Написать программу которая определит количество пакетов молока и
 * пирожков, необходимых каждый день для условий: a) Если в школе 100% всех
 * учеников, у которых вес меньше 30 кг. b) Если в школе 60% учеников, имеют вес
 * меньше 30 кг. c) Если в школе 1% учеников, имеют вес меньше 30 кг.
 * 
 */
public class Task12
{
    public static void main(String[] args)
    {
        int n = 30;
        
    }
}
