package org.itstep.task06;

/**
 * Задание
 * Описать  базовый  класс  MainString  (Строка).
 * Обязатель-ные поля класса:
 *   - массив символов;
 *   - значение типа int хранит длину строки в символах.
 * Реализовать  обязательные  методы  следующего  назначения:
 *   - конструктор без параметров;
 *   - конструктор, принимающий в качестве параметра строковый литерал;
 *   - конструктор, принимающий в качестве параметра символ;
 *   - метод получения длины строки;
 *   - метод очистки строки (делает строку пустой);
 *   - метод поиска символа в строке.
 * 
 */
public class Main {
	public static void main(String[] args) {

	}
}
