package ua.step.example;

/**
 * 
 * Практика с вложенными циклами
 *
 */
public class Task11 {
    public static void main(String[] args)
    {
        for (int i = 0; i < 10; i++)
        {
            for (int j = i; j <= i; j++)
            {
                System.out.print(i + "*" + j + "=" + (i * j) + " ");
            }
            System.out.print("\n");
        }
    }
	// FIXME Вывести таблицу умножения в виде
	// 1*1=1 2*1=2  3*1=3  4*1=4  5*1=5
	// 1*2=2 2*2=4  3*2=6  4*2=8  5*2=10
	// 1*3=2 2*3=6  3*3=9  4*3=12 5*3=15
	// 1*4=2 2*4=8  3*4=12 4*4=16 5*4=20
	// 1*5=2 2*5=10 3*5=15 4*5=20 5*5=25
	// 1*6=2 2*6=12 3*6=18 4*6=24 5*6=30
	// 1*7=2 2*7=14 3*7=21 4*7=28 5*7=35
	// 1*8=2 2*8=16 3*8=24 4*8=32 5*8=40
	// 1*9=2 2*9=18 3*9=27 4*9=36 5*9=45
}