package ua.step.example;

public class Task10
{
    public static void main(String[] args)
    {
        // FIXME раскоментирую код, чтобы нарисовать пустой треугольник 
    	for (int i = 0; i < 10; i++)
        {
            for (int j = i; j < 10; j++)
            {
                //if (i == 0 || j==i || j==9)
                //{
                    System.out.print("*");
                //}
                //else
                //{
                    //System.out.print(" ");
                //}
            }
            System.out.print("\n");
        }
		// FIXME используя вложенные циклы и символ * измени приемер так, чтобы рисовались
		// треугольники указанные в примере 
    	
       /*
     	         *     *          **********             
    	        **     **          *********            
    	       ***     ***          ********           
    	      ****     ****          *******          
    	     *****     *****          ******         
    	    ******     ******          *****        
    	   *******     *******          ****       
    	  ********     ********          ***      
    	 *********     *********          **     
    	**********     **********          *    
    	              
      */    
    	}
}

