package org.itstep.hw06;

/**
 * Реализовать односвязный список в виде класса List.
 *
 * В класс List должен присутствовать вложенный статический (nested) класс Node
 * представляющий отдельный узел списка.
 *
 * Класс Node содержит ссылку на следующий элемент списка (getNext), метод получения
 * данных этого узла (getValue) и переопределенный метод equals для сравнения узлов
 * по значению
 *
 * В классе List реализовать методы добавления элемента в список (add),
 * удаление элемента по значению (remove), получения размера списка (size),
 * очистку всего списка (clear), преобразования всего элемента
 * списка в строку (переопределенный toString), сравнения списков (переопределенный equals)
 *
 * Добавить нужные юнит тесты для класса List
 *
 * Привести пример применения списка для хранения списка автомобилей
 */
public class Main {

    public static void main(String[] args) {

    }
}
